Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.authentik_system.data.kubernetes_service_v1.authentik_server will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_service_v1" "authentik_server" {
      + id     = (known after apply)
      + spec   = (known after apply)
      + status = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "authentik-server"
          + namespace        = "authentik"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.authentik_system.helm_release.authentik will be updated in-place
~ resource "helm_release" "authentik" {
      ~ id                         = "authentik" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "2025.8.4" -> (known after apply)
          ~ chart          = "authentik" -> (known after apply)
          ~ first_deployed = 1758048573 -> (known after apply)
          ~ last_deployed  = 1759253602 -> (known after apply)
          ~ name           = "authentik" -> (known after apply)
          ~ namespace      = "authentik" -> (known after apply)
          ~ notes          = <<-EOT
                Run the commands below to get a kubeconfig file for authentik:
                
                KUBE_API=$(kubectl config view --minify --output jsonpath="{.clusters[*].cluster.server}")
                NAMESPACE=authentik
                SECRET_NAME=$(kubectl get serviceaccount authentik -o jsonpath='{.secrets[0].name}' 2>/dev/null || echo -n "authentik")
                KUBE_CA=$(kubectl -n $NAMESPACE get secret/$SECRET_NAME -o jsonpath='{.data.ca\.crt}')
                KUBE_TOKEN=$(kubectl -n $NAMESPACE get secret/$SECRET_NAME -o jsonpath='{.data.token}' | base64 --decode)
                
                echo "apiVersion: v1
                kind: Config
                clusters:
                - name: default-cluster
                  cluster:
                    certificate-authority-data: ${KUBE_CA}
                    server: ${KUBE_API}
                contexts:
                - name: default-context
                  context:
                    cluster: default-cluster
                    namespace: $NAMESPACE
                    user: authentik-user
                current-context: default-context
                users:
                - name: authentik-user
                  user:
                    token: ${KUBE_TOKEN}"
                
                
                CHART NAME: postgresql
                CHART VERSION: 16.7.26
                APP VERSION: 17.6.0
                
                ⚠ WARNING: Since August 28th, 2025, only a limited subset of images/charts are available for free.
                    Subscribe to Bitnami Secure Images to receive continued support and security updates.
                    More info at https://bitnami.com and https://github.com/bitnami/containers/issues/83267
                
                ** Please be patient while the chart is being deployed **
                
                PostgreSQL can be accessed via port 5432 on the following DNS names from within your cluster:
                
                    authentik-postgresql.authentik.svc.cluster.local - Read/Write connection
                
                To get the password for "postgres" run:
                
                    export POSTGRES_ADMIN_PASSWORD=$(kubectl get secret --namespace authentik authentik-postgresql -o jsonpath="{.data.postgres-password}" | base64 -d)
                
                To get the password for "authentik" run:
                
                    export POSTGRES_PASSWORD=$(kubectl get secret --namespace authentik authentik-postgresql -o jsonpath="{.data.password}" | base64 -d)
                
                To connect to your database run the following command:
                
                    kubectl run authentik-postgresql-client --rm --tty -i --restart='Never' --namespace authentik --image docker.io/library/postgres:17.6-bookworm --env="PGPASSWORD=$POSTGRES_PASSWORD" \
                      --command -- psql --host authentik-postgresql -U authentik -d authentik -p 5432
                
                    > NOTE: If you access the container using bash, make sure that you execute "/opt/bitnami/scripts/postgresql/entrypoint.sh /bin/bash" in order to avoid the error "psql: local user with ID 1001} does not exist"
                
                To connect to your database from outside the cluster execute the following commands:
                
                    kubectl port-forward --namespace authentik svc/authentik-postgresql 5432:5432 &
                    PGPASSWORD="$POSTGRES_PASSWORD" psql --host 127.0.0.1 -U authentik -d authentik -p 5432
                
                WARNING: The configured password will be ignored on new installation in case when previous PostgreSQL release was deleted through the helm command. In that case, old PVC will have an old password, and setting it through helm won't take effect. Deleting persistent volumes (PVs) will solve the issue.
                
                WARNING: There are "resources" sections in the chart not set. Using "resourcesPreset" is not recommended for production. For production installations, please set the following values according to your workload needs:
                  - primary.resources
                  - readReplicas.resources
                +info https://kubernetes.io/docs/concepts/configuration/manage-resources-containers/
                
                ⚠ SECURITY WARNING: Original containers have been substituted. This Helm chart was designed, tested, and validated on multiple platforms using a specific set of Bitnami and Tanzu Application Catalog containers. Substituting other containers is likely to cause degraded security and performance, broken chart features, and missing environment variables.
                
                Substituted images detected:
                  - docker.io/library/postgres:17.6-bookworm
                
                ⚠ SECURITY WARNING: Verifying original container images was skipped. Please note this Helm chart was designed, tested, and validated on multiple platforms using a specific set of Bitnami and Bitnami Secure Images containers. Substituting other containers is likely to cause degraded security and performance, broken chart features, and missing environment variables.
                
                
                CHART NAME: redis
                CHART VERSION: 22.0.4
                APP VERSION: 8.2.1
                
                ⚠ WARNING: Since August 28th, 2025, only a limited subset of images/charts are available for free.
                    Subscribe to Bitnami Secure Images to receive continued support and security updates.
                    More info at https://bitnami.com and https://github.com/bitnami/containers/issues/83267
                
                ** Please be patient while the chart is being deployed **
                
                Redis&reg; can be accessed via port 6379 on the following DNS name from within your cluster:
                
                    authentik-redis-master.authentik.svc.cluster.local
                
                
                
                To connect to your Redis&reg; server:
                
                1. Run a Redis&reg; pod that you can use as a client:
                
                   kubectl run --namespace authentik redis-client --restart='Never'  --image docker.io/library/redis:8.2.1 --command -- sleep infinity
                
                   Use the following command to attach to the pod:
                
                   kubectl exec --tty -i redis-client \
                   --namespace authentik -- bash
                
                2. Connect using the Redis&reg; CLI:
                   redis-cli -h authentik-redis-master
                
                To connect to your database from outside the cluster execute the following commands:
                
                    kubectl port-forward --namespace authentik svc/authentik-redis-master 6379:6379 &
                    redis-cli -h 127.0.0.1 -p 6379
                
                WARNING: There are "resources" sections in the chart not set. Using "resourcesPreset" is not recommended for production. For production installations, please set the following values according to your workload needs:
                  - replica.resources
                  - master.resources
                +info https://kubernetes.io/docs/concepts/configuration/manage-resources-containers/
                
                ⚠ SECURITY WARNING: Original containers have been substituted. This Helm chart was designed, tested, and validated on multiple platforms using a specific set of Bitnami and Tanzu Application Catalog containers. Substituting other containers is likely to cause degraded security and performance, broken chart features, and missing environment variables.
                
                Substituted images detected:
                  - docker.io/library/redis:8.2.1
                
                ⚠ SECURITY WARNING: Verifying original container images was skipped. Please note this Helm chart was designed, tested, and validated on multiple platforms using a specific set of Bitnami and Bitnami Secure Images containers. Substituting other containers is likely to cause degraded security and performance, broken chart features, and missing environment variables.
            EOT -> (known after apply)
          ~ revision       = 5 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - authentik  = {
                      - email           = {
                          - from     = "Authentik <bill@vandenberk.me>"
                          - host     = "smtp.zoho.com"
                          - password = "(sensitive value)"
                          - port     = 465
                          - timeout  = 10
                          - use_ssl  = true
                          - use_tls  = false
                          - username = "bill@vandenberk.me"
                        }
                      - error_reporting = {
                          - enabled = true
                        }
                      - postgresql      = {
                          - password = "(sensitive value)"
                        }
                      - secret_key      = "(sensitive value)"
                    }
                  - postgresql = {
                      - auth    = {
                          - password = "(sensitive value)"
                        }
                      - enabled = true
                      - primary = {
                          - persistence = {
                              - storageClass = "longhorn"
                            }
                        }
                    }
                  - redis      = {
                      - enabled = true
                      - primary = {
                          - persistence = {
                              - storageClass = "longhorn"
                            }
                        }
                    }
                  - server     = {
                      - ingress = {
                          - enabled = false
                        }
                    }
                  - worker     = {
                      - env     = [
                          - {
                              - name  = "AUTHENTIK_BOOTSTRAP_EMAIL"
                              - value = "bill@vandenberk.me"
                            },
                        ]
                      - envFrom = [
                          - {
                              - secretRef = {
                                  - name = "worker-env"
                                }
                            },
                        ]
                    }
                }
            ) -> (known after apply)
          ~ version        = "2025.8.4" -> (known after apply)
        } -> (known after apply)
        name                       = "authentik"
      ~ version                    = "2025.8.4" -> "2025.10.1"
        # (28 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d .
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.billv.ca/lock?id=billv-ca%252Fhomelab-atlantis-k3s-base-services%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d .
  ```
Plan: 0 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```